



/* 
Конструкция для обьявления (создания) констант:
    const тип_данных имя_константы = ее_значение; // обьявление константы

Константы не возможно создавать без инициализации
Константы необходимы для того чтобы использовать значения которые нельзя изменить.
Значение констант изменить нельзя 
Имя констант пишется капсом
*/

const int DAY_IN_WEEK = 7; // Константа для количества дней в недели
    
Console.WriteLine($"DAY_IN_WEEK = {DAY_IN_WEEK}"); 
    
// DAY_IN_WEEK += 1;//  Выдаст ошибку
